smartinhome/SIHOS17/firmware/sdkconfig.defaults
# ESP32-C6
CONFIG_IDF_TARGET="esp32c6"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# WiFi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8

# HTTPD
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_WS_SUPPORT=y

# LittleFS
CONFIG_LITTLEFS_MAX_PARTITIONS=1
CONFIG_LITTLEFS_PAGE_SIZE=256
CONFIG_LITTLEFS_OBJ_NAME_LEN=64

# NVS
CONFIG_NVS_ENCRYPTION=n

# Stos tasku main - sih_config_t (~970B) kopiowany na stos w wifi/ota,
# domyslne 3584B za malo -> stack protection fault. Zwiekszamy do 8KB.
# 12 kB zamiast 8 kB: zapas na wypadek duzych ramek stosu podczas startu
# (konfiguracja urosla do ponad 3 kB po rozszerzeniu przypiec do 32).
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

# Log
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# OTA
CONFIG_OTA_ALLOW_HTTP=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# --- Wydajnosc sieci dla szybkiego OTA ---
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=16
CONFIG_LWIP_TCP_WND_DEFAULT=32768
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32
CONFIG_LWIP_TCP_MSS=1440
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768

# --- FreeRTOS tick 1ms (dla odbioru dlugich ramek wMbus bez FIFO overflow) ---
CONFIG_FREERTOS_HZ=1000

# --- Wiecej gniazd LWIP (webserver + OTA jednoczesnie) ---
# Domyslnie 10 gniazd; webserver przy auto-odswiezaniu zajmowal wszystkie,
# przez co OTA nie moglo otworzyc gniazda TLS (Failed to create socket).
CONFIG_LWIP_MAX_SOCKETS=16
